Revit 2027 API
Camera.FarDistance Property
 Distance to far clipping plane
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FarDistance { get; set; }
Public Property FarDistance As Double
	Get
	Set
public:
property double FarDistance {
	double get ();
	void set (double value);
}
member FarDistance : float with get, set
Property Value
Double
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace